{
  "1": "# Introduction\n\n**ServiceDesk Plus Cloud** is a SaaS-based, ITIL-compliant hosted help desk and asset management application designed for businesses of all sizes. It can be accessed directly over the internet without the need for local software installation.\n\nBuilt on a robust SaaS framework, ServiceDesk Plus Cloud follows industry best practices to deliver a scalable, highly available, and secure help desk and asset management solution. It also includes live data backup and disaster recovery capabilities.\n\nUser data resides in our secure data centers, which are **SOC 1 Type II** and **SOC 2 Type II** compliant, as well as **ISO 27001** (Information Security Management System) and **ISO 22301** (Business Continuity Management System) certified.\n\n## Access Requirements\n- Each user must have a unique email address associated with a valid Zoho Account.\n- A modern web browser such as Microsoft Edge, Firefox, Chrome, or Safari is required.\n- Optional: Windows probes can be installed to enable automatic asset scanning.\n\n## Bandwidth Utilization\n- Minimum bandwidth is sufficient for accessing the application’s web interface.\n- For asset scans:\n- Data transfer between the Probe and each target machine ranges from ~200 KB to 600 KB, depending on hardware/software.\n- Data transfer between the Probe and ServiceDesk Plus Cloud averages ~2 MB per minute during scan operations, depending on the number of successful scans per minute.",
  "2": "# Implementation Stages\n\n## Requirement Gathering\nThis is the first activity performed by ManageEngine during the Onsite Implementation (OIM). The ManageEngine Consultant will gather all relevant requirements and information necessary for a successful OIM of ServiceDesk Plus. This stage also involves interacting with various client stakeholders to ensure the implementation is aligned with expectations and delivers complete satisfaction.\n\n## Task Identification\nBased on the requirements collected, the ManageEngine Consultant will recommend the appropriate OIM model along with the estimated duration. The consultant will also identify all tasks to be executed during the implementation.\n\n## Scoping\nThe ManageEngine Consultant will define the scope of the OIM based on the requirements, information gathered, and the chosen model. This scope will then be shared with the client and key stakeholders for approval.\n\n## Planning\nOnce the scope is approved, the ManageEngine Consultant will develop a detailed plan using project planning tools. This plan will include start and end dates, milestones, tasks, and deliverables. It will help clients track progress, conduct review meetings, and manage any required changes.\n\n## Implementation\nThe approved processes and workflows will be implemented by the ManageEngine Consultant to the best of their expertise and in alignment with client requirements, ensuring complete satisfaction.\n\n## Migration\nIf required, ManageEngine will also assist in migrating data from third-party tools, as defined in the approved scope.\n\n## Testing\nThe ManageEngine Consultant, along with the client’s stakeholders, will validate the processes, workflows, and all other functions that are mandatory for production, as defined in the scope.\n\n## Training\nA well-structured training plan will be created by the ManageEngine Consultant. Comprehensive functional and technical training will be provided to client teams to ensure effective use and operation of ManageEngine ServiceDesk Plus.",
  "3": "# Introduction\n\n**ManageEngine** is the Enterprise IT Management software division of Zoho Corp. For more than a decade, it has been serving the needs of enterprises across more than 200 countries. At present, ManageEngine adds nearly 1,000 new satisfied customers every month, including several from the Fortune 500 list.\n\nApart from addressing the broader enterprise market with a wide range of solutions, ManageEngine also focuses strongly on the help desk market with its specialized offerings.\n\n## ServiceDesk Plus\nManageEngine provides a web-based, ITIL-ready help desk software with an integrated asset management module through ServiceDesk Plus. Today, more than 20,000 IT managers worldwide rely on ServiceDesk Plus to manage their IT help desk and assets.\n\nBy combining ticketing, asset tracking, purchasing, contract management, and a knowledge base into a single, low-cost, and easy-to-use package, ServiceDesk Plus helps improve the productivity of IT service teams while enhancing end-user satisfaction.\n\n## Support and Community\nManageEngine has a vibrant user community for knowledge sharing. In addition, experienced and trained technical consultants are available to provide support through phone and email. Consulting and training services are also offered to address specific customer requirements.",
  "4": "# Terms and Conditions\n\n## Pre-requisites\n- Ensure all required data and pre-requisites are available at the time of implementation.\n\n## Scope of Implementation\n- ManageEngine does not engage in an end-to-end implementation. However, our expert consultant will configure the tool to the best extent possible during the engagement.\n- Implementation and configuration are limited to the agreed Scope of Work and the out-of-the-box features supported by the application.\n\n## Limitations\n- Extensive custom triggers or scripting assistance will not be provided during implementation.\n- Extensive API or integration support will not be provided. Only skeleton-level guidance will be offered, and the client’s developers are responsible for building integrations.\n\n## Activity Tracking\n- The consultant will document and share daily implementation activities with the client for reference.\n\n## Client Responsibilities\n- Any additional configuration beyond the agreed Implementation Agenda must be carried out by the client’s technical team.\n\n## Product Issues and Feature Requests\n- Identified product issues will be raised and tracked separately by the offshore product support team.\n- New feature requests will be added to the product roadmap and prioritized based on demand and market needs.\n\n## Post-Implementation Support\n- After the implementation phase, further queries or support needs will be handled by the ServiceDesk Plus product support team.",
  "5": "# Introduction\n\n**Asset Explorer Cloud** is a SaaS-based asset management application designed for businesses of all sizes. It can be accessed directly over the internet without requiring any software installation.\n\nBuilt on a robust SaaS framework, Asset Explorer Cloud adopts industry best practices to deliver a scalable, highly available, and secure asset management solution on the cloud. It also includes provisions for live data backup and disaster recovery.\n\nUser data resides in our secure data centers, which are **SOC 1 Type II** and **SOC 2 Type II** compliant, as well as **ISO 27001** (Information Security Management System) and **ISO 22301** (Business Continuity Management System) certified.",
  "6": "# Introduction\n\n**ServiceDesk Plus MSP** is a unified ITSM and PSA platform by ManageEngine, specifically designed for Managed Service Providers (MSPs). It enables MSPs to manage IT infrastructure and services for multiple clients from a single help desk.\n\nThe platform offers integrated tools for help desk ticketing, IT asset management, project management, and change management. It also includes centralized account management, remote control, and AI-powered automation features to improve efficiency and enhance service delivery.",
  "7": "# General Configuration\n\n## 5.1 Installation\n- Installation of ServiceDesk Plus with the default PostgreSQL database.\n- Integration with MSSQL database can be performed later, based on requirements.\n\n## 5.2 General Configuration\n- Import users from Active Directory / LDAP or via CSV file.\n- Configure Single Sign-On (SSO) using NETLOGON service or SAML-based authentication.\n- Create technicians and define their roles.\n- Create user groups.\n- Create support groups.\n- Define group roles (support-group based roles) and associate them with support groups and technicians. These roles can be used for group notifications and SLA escalation notifications.\n- Define sites and departments. For organizations with regional offices, each office can be configured as a site in ServiceDesk Plus. Sites help maintain a single installation across multiple locations, with tailored working hours and IT operations. This configuration ensures:\n- Restricted technician access based on sites.\n- Better organization of IT operations across sites.\n- Prompt handling of requests from different regions.\n\n> Note:* Without proper site mapping to users/departments, it becomes complex—and often not feasible—to customize site-based approvals, group assignments, SLAs, and reports. It is strongly recommended to configure this mapping in Active Directory before importing site data into the application.\n\n- Define operational hours and holidays based on sites.\n- Explain technician scheduler usage.\n- Configure incoming and outgoing email settings.\n- Set up support (technician) group-based mail configurations. For group email settings, configure email forwarding and “Send As” permissions.\n- Define organizational roles for different hierarchy levels within the organization.\n- Integrate with an SMS gateway (Site24x7, BulkSMS, Clickatell) if required.\n- Create customized product tours to help users familiarize themselves with the Self-Service Portal.",
  "8": "# General Configuration\n\n## Application Setup\n- Sign up for the application and select the preferred data center.\n- Configure and verify your organization’s domain name.\n- Build a custom domain URL for your organization.\n\n## User Management\n- Import user data from Active Directory (AD), Azure, or CSV files.\n- Set up scheduled syncing of users from AD (via Task Scheduler) or Azure.\n- Configure SAML-based authentication.\n\n## Email Configuration\n- Configure incoming and outgoing email settings.\n\n## Sites and Departments\n- Define sites and departments. For organizations with multiple regional offices, each office can be configured as a site in ServiceDesk Plus. This ensures:\n- A single installation is maintained regardless of location, working hours, or IT operations.\n- Restricted technician access based on site.\n- Organized IT operations across multiple regions.\n- Prompt handling of requests raised from different sites.\n\n> Note:* Without proper site mapping to users or departments, it becomes complex—and often not feasible—to customize site-based approvals, group assignments, SLAs, and reports. We strongly recommend configuring this in AD before importing site data into the application.\n\n## Operational Setup\n- Define site-specific operational hours and holidays.\n- Create technicians and define their roles.\n- Create user groups.\n- Create technician groups.\n- Configure technician group-based email settings. Each group can have a dedicated email. For group email settings, configure email forwarding and “Send As” permissions.\n\n## Roles and Approvals\n- Configure organizational roles at different hierarchical levels to enable approval processes for service requests and manage SLA escalations.\n\n## Customization and ESM\n- Customize the Self-Service Portal with widgets.\n- Configure Enterprise Service Management (ESM) to build multiple portals, based on the ESM license.\n\n## Data Migration\n- Migrate data from third-party applications using CSV or XLS files.\n- Up to ~1,000 active requests (including text field information and notes) can be migrated. Inline images and attachments are not included.\n\n> Note:* A maximum of 15 records will be created/configured by the consultant as part of the implementation.",
  "9": "# Incident Management\n\n## Configuration Activities\n- Create or import categories, subcategories, and items.\n- Define status, levels, modes, impact, urgency, priority, priority matrix, and request types.\n- Create incident templates.\n- Define custom fields based on requirements.\n- Customize templates using field and form rules (note: this can be a time-consuming process).\n- Define tasks.\n- Define business rules.\n- Define SLA rules.\n- Configure request closure rules.\n- Create technician custom views.\n- Enable notifications and customize notification emails and reply templates.\n- Enable user surveys, including defining questions and answer choices.\n- Configure preventive maintenance tasks.\n- Provide an overview of the announcements feature.\n\n> Note:* A maximum of 15 records will be created/configured by the consultant.",
  "10": "# Service Requests\n\n## Configuration Activities\n- Create service categories.\n- Create service request templates and define workflows (approvals and resource-type questions). Images and cost can be defined for resource-type questions.\n- Define tasks.\n- Configure service request field and form rules (note: this can be a time-consuming process).\n- Define business rules.\n- Define SLAs.\n\n> Note:* A maximum of 10 records will be created/configured by the consultant.",
  "11": "# Problem Management\n\n## Configuration Activities\n- Create or customize problem management templates.\n- Configure additional fields and closure rules for problems.",
  "12": "# Change Management\n\n## Configuration Activities\n- Customize change templates.\n- Add additional fields for changes, if required.\n- Configure and associate change workflows.\n- Create change roles.\n- Define CAB members.\n- Customize change closure rules.\n- Enable the change module for requesters (end users).\n- Configure conflict detection for changes, along with freeze and maintenance window settings.\n\n> Note:* A maximum of 5 records will be created/configured by the consultant.",
  "13": "# Release Management\n\n## Configuration Activities\n- Customize release templates.\n- Add additional fields for releases, if required.\n- Configure and associate release workflows.\n- Create release roles.\n\n> Note:* A maximum of 5 records will be created/configured by the consultant.",
  "14": "# Knowledge Management\n\n## Configuration Activities\n- Customize solution templates.\n- Define solution topics and share best practices for their usage.\n- Create solution articles or import solution data from a file.",
  "15": "# Project Management\n\n## Configuration Activities\n- Define project types, project roles, and project status options.\n- Create project templates.\n- Create a sample project and demonstrate the workflow.\n\n> Note:* A maximum of 2 records will be created/configured by the consultant.",
  "16": "# Asset Management\n\n## Configuration Activities\n- Deploy agents through GPO for scanning workstations and servers.\n- Trigger domain or network scans if required.\n- Create new product types.\n- Create additional fields for workstations or assets.\n- Import non-IT assets and components through CSV files.\n- Define software licenses or import them through CSV files.\n- Configure asset life cycle management.\n- Configure asset replenishment.\n\n> Notes:*\n- Deploying the agent or script through Active Directory GPO will be carried out with the help of the client’s domain expert.\n- The client is responsible for resolving any network issues that may arise.\n- The ManageEngine consultant will assist with network scanning and aim to inventory as many devices as possible.",
  "17": "# Asset Management\n\n## Configuration Activities\n- Install the probe server.\n- Install scripts manually or deploy them through GPO for scanning workstations and servers.\n- Trigger domain or network scans if required.\n- Create new product types.\n- Create additional fields for workstations or assets.\n- Import non-IT assets and components through CSV files.\n- Define software licenses or import them through CSV files.\n- Configure asset life cycle management.\n- Configure asset replenishment.\n\n> Notes:*\n- Deploying the agent or script through Active Directory GPO will be carried out with the help of the client’s domain expert.\n- The client is responsible for resolving any network issues that may arise.\n- The ManageEngine consultant will assist with network scanning and aim to inventory as many devices as possible.",
  "18": "# CMDB\n\n## Configuration Activities\n- Create new CI types.\n- Create relationship types.\n- Import CI relationship data through XLS files.\n- Assist customers in building CI sync rules.\n\n> Notes:*\n- A maximum of 20 records will be created/configured by the consultant.\n- Relationships between assets must be built manually.\n- Assistance will be provided for creating sync rules, which allow you to define actions on CIs and their relationships based on the data available in assets and software installations.",
  "19": "# Purchase Management\n\n## Configuration Activities\n- Customize the purchase order template (customization is applicable only to the default template).\n- Create purchase order additional fields and add them to the respective forms, if needed.\n- Create and demonstrate a sample record.\n\n> Notes:*\n- Purchase management supports a maximum of 12 text fields, 4 numeric fields, and 4 date/time fields.",
  "20": "# Contract Management\n\n## Configuration Activities\n- Customize contract templates.\n- Create a vendor database.\n- Create contracts or import contract data through XLS files.\n\n> Notes:*\n- A maximum of 20 records will be created/configured by the consultant.\n- Contract management supports a maximum of 12 text fields, 4 numeric fields, and 4 date/time fields.",
  "21": "# Reports\n\n## Configuration Activities\n- Demonstrate default reports and build custom reports.\n- Integrate with Zoho Analytics (if purchased).\n- Customize dashboard widgets.",
  "22": "# Other Functionalities\n\n## Configuration Activities\n- Enable data archiving.\n- Configure custom notifications.\n- Enable and demonstrate ServiceDesk Plus mobile applications (iOS and Android).\n- Discuss Enterprise Service Management (ESM) and instance types (e.g., HR, Facilities).",
  "23": "# Infrastructure Prerequisites – ServiceDesk Plus Cloud\n\n## Super Admin Requirement\nIt is recommended to have a common super admin for all Zoho services used across the organization. Since the user email address is unique in Zoho, you must maintain the organization’s email within the application. If the user already has free or trial accounts, the email must be changed or those accounts closed before proceeding.\n\n## Domain Verification\nYou can access ServiceDesk Plus Cloud either via the default subdomain (sdpondemand.manageengine.com) or a custom organization domain URL.\n- To use a custom domain, verify it in Zoho to ensure validity and administrative privileges.\n- Organizations may use multiple domains (e.g., acmebuilders.com, acmeproperties.com, acmesecurities.com). All such domains can be configured and verified so users with those email addresses can be added without invitation or verification.\n- Add and verify domains in: *ESM Directory → Verified Domains*.\n- CNAME alias for verification must point to zmverify.zoho.com (e.g., zbxxxxx.domain.com → zmverify.zoho.com).\n\n> Note:* Users from verified domains will not receive invitation emails. Verify domains before importing users.\n\nCNAME verification steps: https://www.zoho.com/mail/help/adminconsole/domain-verification.html\n\n## Custom Domain URL Configuration\n- Default portal URL: sdpondemand.manageengine.com.\n- Optionally configure a custom domain (e.g., helpdesk.acme.com).\n- Configure this in: *ESM Directory → Manage Portal*.\n- Add a CNAME entry pointing to customersdpondemand.manageengine.com.\n- SSL certification is auto-initiated for the custom domain. Once installed, HTTPS will be enforced for all links and notifications.\n\n## User Management\n- Import users / configure authentication preferences.\n- Users from verified domains bypass invitation emails.\n\n## SAML / SSO Configuration\n- ServiceDesk Plus Cloud supports SAML 2.0 for identity provider (IdP) integration.\n- Supported IdPs: ADFS, Azure AD/O365, Google Workspace, Okta, OneLogin.\n- Organization ID (ORG ID) is found under: *ESM Directory → Organization Details*.\n- SSO URL: https://accounts.zoho.com/signin/samlsp/<ORG ID>\n- Guides: https://help.sdpondemand.com/identity-providers | https://help.sdpondemand.com/azure-ad-new\n\n## Mail Server Settings\n- Configure mail servers to send/receive emails within the application.\n- Supported: Native Email Service (built-in), Microsoft Email Services (Office 365, Outlook), Other Mailboxes.\n- If using a local mail server, whitelist these IPs:\n- 136.143.187.53\n- 136.143.191.166\n- 136.143.183.166\n- 136.143.186.53\n- 204.141.43.166\n- 204.141.33.166\n- Guide: https://help.sdpondemand.com/mail-server-settings",
  "24": "# Infrastructure Prerequisites – ServiceDesk Plus MSP\n\n## Super Admin Requirement\nIt is recommended to have a common super admin for all Zoho services used across the organization. Since the user email address is unique in Zoho, you must maintain the organization’s email within the application. If the user already has free or trial accounts, the email must be changed or those accounts closed before proceeding.\n\n## Domain Verification\nYou can access ServiceDesk Plus MSP either via the default subdomain (sdpondemand.manageengine.com) or a custom organization domain URL.\n- To use a custom domain, verify it in Zoho to ensure validity and administrative privileges.\n- Organizations may use multiple domains (e.g., acmebuilders.com, acmeproperties.com, acmesecurities.com). All such domains can be configured and verified so users with those email addresses can be added without invitation or verification.\n- Add and verify domains in: *ESM Directory → Verified Domains*.\n- CNAME alias for verification must point to zmverify.zoho.com (e.g., zbxxxxx.domain.com → zmverify.zoho.com).\n\n> Note:* Users from verified domains will not receive invitation emails. Verify domains before importing users.\n\nCNAME verification steps: https://www.zoho.com/mail/help/adminconsole/domain-verification.html\n\n## Custom Domain URL Configuration\n- Default portal URL: sdpondemand.manageengine.com.\n- Optionally configure a custom domain (e.g., helpdesk.acme.com).\n- Configure this in: *ESM Directory → Manage Portal*.\n- Add a CNAME entry pointing to customersdpondemand.manageengine.com.\n- SSL certification is auto-initiated for the custom domain. Once installed, HTTPS will be enforced for all links and notifications.\n\n## User Management\n- Import users / configure authentication preferences.\n- Users from verified domains bypass invitation emails.\n\n## SAML / SSO Configuration\n- ServiceDesk Plus MSP supports SAML 2.0 for identity provider (IdP) integration.\n- Supported IdPs: ADFS, Azure AD/O365, Google Workspace, Okta, OneLogin.\n- Organization ID (ORG ID) is found under: *ESM Directory → Organization Details*.\n- SSO URL: https://accounts.zoho.com/signin/samlsp/<ORG ID>\n- Guides: https://help.sdpondemand.com/identity-providers | https://help.sdpondemand.com/azure-ad-new\n\n## Mail Server Settings\n- Configure mail servers to send/receive emails within the application.\n- Supported: Native Email Service (built-in), Microsoft Email Services (Office 365, Outlook), Other Mailboxes.\n- If using a local mail server, whitelist these IPs:\n- 136.143.187.53\n- 136.143.191.166\n- 136.143.183.166\n- 136.143.186.53\n- 204.141.43.166\n- 204.141.33.166\n- Guide: https://help.sdpondemand.com/mail-server-settings",
  "25": "# Infrastructure Prerequisites – Asset Explorer Cloud\n\n## Super Admin Requirement\nIt is recommended to have a common super admin for all Zoho services used across the organization. Since the user email address is unique in Zoho, you must maintain the organization’s email within the application. If the user already has free or trial accounts, the email must be changed or those accounts closed before proceeding.\n\n## Domain Verification\nYou can access Asset Explorer Cloud either via the default subdomain (sdpondemand.manageengine.com) or a custom organization domain URL.\n- To use a custom domain, verify it in Zoho to ensure validity and administrative privileges.\n- Organizations may use multiple domains (e.g., acmebuilders.com, acmeproperties.com, acmesecurities.com). All such domains can be configured and verified so users with those email addresses can be added without invitation or verification.\n- Add and verify domains in: *ESM Directory → Verified Domains*.\n- CNAME alias for verification must point to zmverify.zoho.com (e.g., zbxxxxx.domain.com → zmverify.zoho.com).\n\n> Note:* Users from verified domains will not receive invitation emails. Verify domains before importing users.\n\nCNAME verification steps: https://www.zoho.com/mail/help/adminconsole/domain-verification.html\n\n## Custom Domain URL Configuration\n- Default portal URL: sdpondemand.manageengine.com.\n- Optionally configure a custom domain (e.g., helpdesk.acme.com).\n- Configure this in: *ESM Directory → Manage Portal*.\n- Add a CNAME entry pointing to customersdpondemand.manageengine.com.\n- SSL certification is auto-initiated for the custom domain. Once installed, HTTPS will be enforced for all links and notifications.\n\n## User Management\n- Import users / configure authentication preferences.\n- Users from verified domains bypass invitation emails.\n\n## SAML / SSO Configuration\n- Asset Explorer Cloud supports SAML 2.0 for identity provider (IdP) integration.\n- Supported IdPs: ADFS, Azure AD/O365, Google Workspace, Okta, OneLogin.\n- Organization ID (ORG ID) is found under: *ESM Directory → Organization Details*.\n- SSO URL: https://accounts.zoho.com/signin/samlsp/<ORG ID>\n- Guides: https://help.sdpondemand.com/identity-providers | https://help.sdpondemand.com/azure-ad-new\n\n## Mail Server Settings\n- Configure mail servers to send/receive emails within the application.\n- Supported: Native Email Service (built-in), Microsoft Email Services (Office 365, Outlook), Other Mailboxes.\n- If using a local mail server, whitelist these IPs:\n- 136.143.187.53\n- 136.143.191.166\n- 136.143.183.166\n- 136.143.186.53\n- 204.141.43.166\n- 204.141.33.166\n- Guide: https://help.sdpondemand.com/mail-server-settings",
  "26": "# Asset Scanning (Minimum Requirements for the Probe to Run and Successfully Scan Assets)\n\n## Probe Model\nThe application uses a probe-server model. Remote probes must be installed first; these run as Windows services. Data transfer between the central server and the probe is secured using HTTPS.\n\nAdding, installing, and managing remote probes: https://help.sdpondemand.com/install-probe\n\n## Requirements for Target Assets\n- **Windows machines**\n- Remote registry service must be running.\n- Port 139 (file sharing) must be open.\n- Admin$ share (\\\\TargetMachine\\admin$) must be accessible from the probe machine.\n- The login credentials provided must have local administrative privileges.\n\n- **Linux machines**\n- SSH service must be running.\n- Port 22 must be open.\n\n- **Printers, routers, switches**\n- Port 161 must be open.\n- SNMP v1, v2c, or v3 must be enabled, and corresponding credentials must be configured for network scan.\n\n- **Probe requirements**\n- Port 5454 must be accessible from the target workstation for self-scan to upload scan data to the probe.\n- The probe setup requires .NET Framework 4.5 or above. Install it if not already available.\n\n## Scanning Process\n- During a network or domain scan, the probe identifies alive hosts.\n- For each host, it determines whether to perform a Windows, Linux, or SNMP scan based on:\n- Configured credentials.\n- Open ports.\n- Detected device type.\n- **Windows devices**: probe copies scan files to the Admin$ share and executes them.\n- **Linux devices**: probe copies and executes a shell script.\n- **SNMP devices**: probe queries predefined OIDs.\n- Scan results are uploaded back to the application via the probe.",
  "27": "# Asset Scanning – On-Premises (Desktop Central Agent-Based Scan)\n\n## Guides\n- Desktop Central for Agent-based Scan: https://help.servicedeskplus.com/dc-agent-sdp\n- Agent Configuration: https://help.servicedeskplus.com/agent-configuration\n- Agent Deployment: https://help.servicedeskplus.com/agent-deployment\n\n## Overview\n- Agent-based scanning is supported for Windows, Linux, and Mac machines.\n- Desktop Central must be installed before performing agent-based scans.\n- SNMP v1, v2, and v3 are supported for network devices such as routers and switches.\n\n## Scanning Roaming User Devices\n- Designed for devices of users who frequently travel and are not always connected to the corporate network.\n- Achieved through agents installed on Windows, Linux, and Mac machines using Desktop Central.\n- More details on AE and Desktop Central integration are available in the official documentation.\n\n## Pre-requisites\n- Ensure that the Desktop Central server is reachable using a public IP address.\n- Configure the external router to direct requests sent to the public IP address to the private IP address of the Desktop Central server machine.\n- Example: route all requests for x.x.x.x at ports 8020, 8383, and 8027 to y.y.y.y at the respective ports.\n- It is recommended to configure the private IP address as static for uninterrupted communication.\n\n> Notes:*\n1. It is recommended to enable HTTPS for all communications.\n2. Default ports used by Desktop Central:\n- Server port: 8383\n- Notification server port: 8027\n- Remote control and tools: 8443\n- File transfer port: 8031\n3. To perform on-demand operations on remote laptops, ensure proxy/firewall settings allow these ports.\n\n## Agent Deployment\n- After completing the prerequisites, download the agents and install them on machines.\n- Agents will then connect via the public IP address for further communications.\n\n## Distributed Asset Scan\n- For workstations at remote sites that cannot be accessed directly by the central server:\n- Install a remote AE server in each location/site.\n- This remote AE server scans the workstations locally.\n- Scan results are pushed to the central ServiceDesk Plus server either manually or automatically."
}